import re
# 1. 腾讯qq号: (腾讯qq号从10000开始,最少5位纯数字,上不封顶)
print(re.match('[1-9][0-9]{4,}','12345')) # match='12345'
print(re.match('[1-9][0-9]{4,}','123456')) # match='123456'
print(re.match('[1-9][0-9]{4,}','1234567')) # match='1234567'
print(re.match('[1-9][0-9]{4,}','1234')) # None
print(re.match('[1-9][0-9]{4,}','812345')) # match='812345'

# 2. IP地址: 192.168.11.5
print(re.match('\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}','192.168.11.5')) # match='192.168.11.5'
print(re.match('\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}','0.0.0.0')) # match='0.0.0.0'
print(re.match('\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}','10.10.10')) # None
print(re.match('\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}','1922.111.10.1')) # None

# 3. 手机号正则 第一位1,第二位3-9,共11位,纯数字
print(re.match('1[3-9][0-9]{9}','16699880011')) # match='16699880011'
print(re.match('1[3-9][0-9]{9}','1669988001')) # None
print(re.match('1[3-9][0-9]{9}','26699880011')) # None
print(re.match('1[3-9][0-9]{9}','116699880011')) # None